app/controllers/channels_controller.rb

SELECT `channel`.* FROM `channel`
---
  def index
    @channels = Channel.all

SELECT "channel".* FROM "channel" WHERE "channel"."chanid" = ? LIMIT 1  [["chanid", "980190962"]]
---
  def show
    @channel = Channel.find(params[:id])

SELECT "channel".* FROM "channel" WHERE "channel"."chanid" = ? LIMIT 1  [["chanid", "980190962"]]
---
  def edit
    @channel = Channel.find(params[:id])

INSERT INTO "channel" ("atsc_major_chan", "atsc_minor_chan", "brightness", "callsign", "chanid", "channum", "colour", "commmethod", "contrast", "default_authority", "finetune", "freqid", "hue", "icon", "last_record", "mplexid", "name", "outputfilters", "recpriority", "serviceid", "sourceid", "tvformat", "useonairguide", "videofilters", "visible", "xmltvid") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @channel = Channel.new(params[:channel])

    respond_to do |format|
      if @channel.save

SELECT "channel".* FROM "channel" WHERE "channel"."chanid" = ? LIMIT 1  [["chanid", "980190962"]]
---
  def update
    @channel = Channel.find(params[:id])

SELECT "channel".* FROM "channel" WHERE "channel"."chanid" = ? LIMIT 1  [["chanid", "980190962"]]
DELETE FROM "channel" WHERE "channel"."chanid" = ?  [["chanid", 980190962]]
---
  def destroy
    @channel = Channel.find(params[:id])
    @channel.destroy